docs/1c-export-2026-06-02/InformationRegisters/ИдентификаториКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаториКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Торговый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/МодульPushУведомлений/Ext/Module.bsl
Процедура ОтправитьPushУведомления(ТипУведомления, Данные) Экспорт 
	
	Если ТипУведомления = "НовоеСообщение" Тогда 
		ОтправитьPush_НовоеСообщение(Данные);
	ИначеЕсли ТипУведомления = "Напоминание" Тогда 
        ОтправитьPush_Напоминание(Данные)
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ОтправитьPush_НовоеСообщение(Данные)

	МассивПолучатели = Новый Массив;
	
	Заголовок = "";
	УИД_Чата = Неопределено;
	Если ТипЗнч(Данные.Получатель) = Тип("СправочникСсылка.ГруппыЧата") Тогда 
		Заголовок = Строка(Данные.Получатель);
		УИД_Чата = Строка(Данные.Получатель.УникальныйИдентификатор()); 
		Для Каждого Элемент Из Данные.Получатель.Учасники Цикл 
			Если Элемент = Данные.Отправитель Тогда 
				Продолжить;
			КонецЕсли;
			
			 МассивПолучатели.Добавить(Элемент.Пользователь);
		 КонецЦикла;
		 
	Иначе
		Заголовок = Строка(Данные.Отправитель);
		УИД_Чата = Строка(Данные.Отправитель.УникальныйИдентификатор()); 

		МассивПолучатели.Добавить(Данные.Получатель);
	КонецЕсли;
	
	
	
	Уведомление = fcm_Уведомлени_HTTP_v1_API.СоздатьУведомление();
	
	Уведомление.data["УИД_Чата"] = Данные.Получатель;
	Уведомление.data["Действие"] = "НовоеСообщение";
	
	// Зададим оповещение, отображаемое на экране.
	Оповещение = fcm_Уведомлени_HTTP_v1_API.СоздатьОповещение();
	Оповещение.title = Заголовок;
	Оповещение.body = Лев(Данные.ТекстСообщения, 128);
	
	Уведомление.notification = Оповещение;
	
	ОтправитьPush(МассивПолучатели, Уведомление);
	
КонецПроцедуры

Процедура ОтправитьPush_Напоминание(Данные)
	
	Уведомление = fcm_Уведомлени_HTTP_v1_API.СоздатьУведомление();
	
	Уведомление.data = Данные.ДанныеУведомления;
		
	// Зададим оповещение, отображаемое на экране.
	Оповещение = fcm_Уведомлени_HTTP_v1_API.СоздатьОповещение();
	Оповещение.title = Данные.Заголовок;
	Оповещение.body = Данные.ТекстСообщения;
	
	Уведомление.notification = Оповещение;
	
	ОтправитьPush(Данные.Получатель, Уведомление);
	
КонецПроцедуры

Процедура ОтправитьPush(МассивПолучатели, Уведомление) 
	ИдентификаторПроекта = Константы.ИдентификаторПроектаFirebase.Получить();

	ОповещениеAndroid = fcm_Уведомлени_HTTP_v1_API.СоздатьОповещениеAndroid();
	ОповещениеAndroid.notification_priority = fcm_Уведомлени_HTTP_v1_API.ПриоритетОповещенияВысокий();
	ОповещениеAndroid.visibility = fcm_Уведомлени_HTTP_v1_API.ВидимостьУведомленияПриватное();
	
	КонфигурацияAndroid = fcm_Уведомлени_HTTP_v1_API.СоздатьКонфигурациюAndroid();
	КонфигурацияAndroid.priority = fcm_Уведомлени_HTTP_v1_API.ПриоритетAndroidВысокий();
	КонфигурацияAndroid.notification = ОповещениеAndroid;
	
	Уведомление.android = КонфигурацияAndroid;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеКлючаДоступа = Константы.ДаныеКлючаДоступаGoogleAPI.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Проверка сохраненного ключа доступа
	КлючДоступаАктуален = Тип(ДанныеКлючаДоступа) = Тип("Структура")
	И ТекущаяУниверсальнаяДата() < ДанныеКлючаДоступа.СрокДействия;
	
	Если Не КлючДоступаАктуален Тогда
		// Ключ доступа не актуален. Необходимо выполнить авторизацию и сохранить новый ключ доступа.
		
		СрокДействия = 3600; // 10 минут
		КлючДоступа = fcm_Уведомлени_HTTP_v1_API.ПолучитьКлючДоступаGoogleAPI(
		Константы.КлючДоступаПроектаFirebase.Получить().Получить(),
		fcm_Уведомлени_HTTP_v1_API.РазрешениеFCMОтправкаУведомлений(),
		Константы.ПутьКOpenSsl.Получить()
		);
		
		ДанныеКлючаДоступа = Новый Структура;
		ДанныеКлючаДоступа.Вставить("КлючДоступа", КлючДоступа);
		ДанныеКлючаДоступа.Вставить("СрокДействия", ТекущаяУниверсальнаяДата() + СрокДействия);
		
		УстановитьПривилегированныйРежим(Истина);
		Константы.ДаныеКлючаДоступаGoogleAPI.Установить(Новый ХранилищеЗначения(ДанныеКлючаДоступа));
		УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		
		КлючДоступа = ДанныеКлючаДоступа.КлючДоступа;
		
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаториКлиентов.ИдентификаторПолучателя,
		|	ИдентификаториКлиентов.ИдентификаторПриложения
		|ИЗ
		|	РегистрСведений.ИдентификаториКлиентов КАК ИдентификаториКлиентов
		|ГДЕ                                                                                                                                                                             
		|	ИдентификаториКлиентов.Торговый.Користувач В(&МассивПолучатели)";
	
	Запрос.УстановитьПараметр("МассивПолучатели", МассивПолучатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
		Уведомление.token =  Выборка.ИдентификаторПолучателя.Получить().ИдентификаторУстройства;
		ИдентификаторУведомления = fcm_Уведомлени_HTTP_v1_API.ОтправитьУведомление(
		Уведомление, ИдентификаторПроекта, КлючДоступа);
		
		//Сообщить(Локализация.СтрШаблонУкр(НСтр("ru='Уведомление отправлено. Идентификатор: %1'"), ИдентификаторУведомления));
	Исключение
		мОшибка = ОписаниеОшибки();
		Если Найти(мОшибка, "SenderId mismatch") Тогда 
			Набор = РегистрыСведений.ИдентификаториКлиентов.СоздатьНаборЗаписей();
			Набор.Отбор.ИдентификаторПриложения.Установить(Выборка.ИдентификаторПриложения);
			Набор.Записать();
		КонецЕсли;
		
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
